<?php

namespace Database\Seeders\urs;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Hash;
use Illuminate\Support\Str;

class TagSeeder extends Seeder
{
    public function run()
    {
        DB::table('tags')->insert([
        [
            'id' => '1',
            'title' => 'банкоматы',
        ],
        [
            'id' => '2',
            'title' => 'аксессуары, бижутерия',
        ],
        [
            'id' => '3',
            'title' => 'детская обувь',
        ],
        [
            'id' => '4',
            'title' => 'детская одежда',
        ],
        [
            'id' => '5',
            'title' => 'женская обувь',
        ],
        [
            'id' => '6',
            'title' => 'женская одежда',
        ],
        [
            'id' => '7',
            'title' => 'игрушки',
        ],
        [
            'id' => '8',
            'title' => 'косметика и парфюмерия',
        ],
        [
            'id' => '9',
            'title' => 'мобильные телефоны и аксесуары',
        ],
        [
            'id' => '10',
            'title' => 'мужская обувь',
        ],
        [
            'id' => '11',
            'title' => 'мужская одежда',
        ],
        [
            'id' => '12',
            'title' => 'нижнее белье',
        ],
        [
            'id' => '13',
            'title' => 'продукты питания',
        ],
        [
            'id' => '14',
            'title' => 'развлечения',
        ],
        [
            'id' => '15',
            'title' => 'рестораны, кафе и быстрое питание',
        ],
        [
            'id' => '16',
            'title' => 'связь и мобильные телефоны',
        ],
        [
            'id' => '17',
            'title' => 'товары для детей',
        ],
        [
            'id' => '18',
            'title' => 'товары для дома',
        ],
        [
            'id' => '19',
            'title' => 'товары для дома и спорта',
        ],
        [
            'id' => '20',
            'title' => 'товары для животных',
        ],
        [
            'id' => '21',
            'title' => 'товары для здоровья',
        ],
        [
            'id' => '22',
            'title' => 'услуги',
        ],
        [
            'id' => '23',
            'title' => 'электроника',
        ],
        [
            'id' => '24',
            'title' => 'ювелирные изделия и часы',
        ],
        [
            'id' => '25',
            'title' => 'цветы и праздничная упаковка',
        ],
        [
            'id' => '26',
            'title' => 'табак, электронные сигареты, кальяны',
        ],
        [
            'id' => '27',
            'title' => 'забота об инвалидах',
        ],
        [
            'id' => '28',
            'title' => 'туалеты',
        ],
        ]);
    }
}
